# SF Salaries Exercise 

Welcome to a quick exercise for you to practice your pandas skills! We will be using the [SF Salaries Dataset](https://www.kaggle.com/kaggle/sf-salaries) from Kaggle! Just follow along and complete the tasks outlined in bold below. The tasks will get harder and harder as you go along.

** Import pandas as pd.**

In [1]:
import pandas as pd
import os
os.environ['Day_2_path'] = r"C:/Users/pvalluru/Desktop/Python_practice/INeuron.ai/Files Shared/"
dataSetPath = os.environ['Day_2_path'] + 'Salaries.csv'
print(dataSetPath)

C:/Users/pvalluru/Desktop/Python_practice/INeuron.ai/Files Shared/Salaries.csv

** Read Salaries.csv as a dataframe called sal.**

In [2]:
SalariesFrame = pd.read_csv(dataSetPath)

** Check the head of the DataFrame. **

In [3]:
SalariesFrame.head(5)

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

** Use the .info() method to find out how many entries there are.**

In [4]:
SalariesFrame.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
Id                  148654 non-null int64
EmployeeName        148654 non-null object
JobTitle            148654 non-null object
BasePay             148045 non-null float64
OvertimePay         148650 non-null float64
OtherPay            148650 non-null float64
Benefits            112491 non-null float64
TotalPay            148654 non-null float64
TotalPayBenefits    148654 non-null float64
Year                148654 non-null int64
Notes               0 non-null float64
Agency              148654 non-null object
Status              0 non-null float64
dtypes: float64(8), int64(2), object(3)
memory usage: 14.7+ MB

In [7]:
SalariesFrame.columns

Index(['Id', 'EmployeeName', 'JobTitle', 'BasePay', 'OvertimePay', 'OtherPay',
       'Benefits', 'TotalPay', 'TotalPayBenefits', 'Year', 'Notes', 'Agency',
       'Status'],
      dtype='object')

**What is the average BasePay ?**

In [9]:
SalariesFrame['BasePay'].mean()

66325.44884050643

** What is the highest amount of OvertimePay in the dataset ? **

In [10]:
SalariesFrame['OvertimePay'].max()

245131.88

** What is the job title of  JOSEPH DRISCOLL ? Note: Use all caps, otherwise you may get an answer that doesn't match up (there is also a lowercase Joseph Driscoll). **

In [16]:
SalariesFrame.loc[SalariesFrame['EmployeeName'] == 'JOSEPH DRISCOLL']['JobTitle']

24    CAPTAIN, FIRE SUPPRESSION
Name: JobTitle, dtype: object

In [17]:
SalariesFrame.loc[SalariesFrame['EmployeeName'] == 'JOSEPH DRISCOLL']

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
24,25,JOSEPH DRISCOLL,"CAPTAIN, FIRE SUPPRESSION",140546.86,97868.77,31909.28,NaN,270324.91,270324.91,2011,NaN,San Francisco,NaN

** How much does JOSEPH DRISCOLL make (including benefits)? **

In [18]:
SalariesFrame.loc[SalariesFrame['EmployeeName'] == 'JOSEPH DRISCOLL']['TotalPay']

24    270324.91
Name: TotalPay, dtype: float64

** What is the name of highest paid person (including benefits)?**

In [34]:
SalariesFrame.loc[SalariesFrame['TotalPay'] == SalariesFrame['TotalPay'].max()]

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN

** What is the name of lowest paid person (including benefits)? Do you notice something strange about how much he or she is paid?**

In [33]:
SalariesFrame.loc[SalariesFrame['TotalPay'] == SalariesFrame['TotalPay'].min()]

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.0,0.0,-618.13,0.0,-618.13,-618.13,2014,NaN,San Francisco,NaN

** What was the average (mean) BasePay of all employees per year? (2011-2014) ? **

In [44]:
SalariesFrame.loc[(SalariesFrame['Year'] >= 2011) & (SalariesFrame['Year'] <= 2014)].groupby(by='Year').mean()

,Id,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Notes,Status
Year,,,,,,,,,
2011,18080.0,63595.956517,4531.065429,3617.081926,NaN,71744.103871,71744.103871,NaN,NaN
2012,54542.5,65436.406857,5023.417824,3653.437583,26439.966967,74113.262265,100553.229232,NaN,NaN
2013,91728.5,69630.030216,5281.641980,3819.969007,23829.076572,77611.443142,101440.519714,NaN,NaN
2014,129593.0,66564.421924,5401.993737,3505.421251,24789.601756,75463.918140,100250.918884,NaN,NaN

** How many unique job titles are there? **

In [45]:
len(set(SalariesFrame['JobTitle'].tolist()))

2159

** What are the top 5 most common jobs? **

In [74]:
SalariesFrame['count'] = 1
SalariesFrame.groupby(by='JobTitle').count().sort_values('count', ascending=False).head(5)

,Id,EmployeeName,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status,count
JobTitle,,,,,,,,,,,,,
Transit Operator,7036,7036,6975,7036,7036,7036,7036,7036,7036,0,7036,0,7036
Special Nurse,4389,4389,4382,4389,4389,4389,4389,4389,4389,0,4389,0,4389
Registered Nurse,3736,3736,3725,3736,3736,3736,3736,3736,3736,0,3736,0,3736
Public Svc Aide-Public Works,2518,2518,2514,2518,2518,2518,2518,2518,2518,0,2518,0,2518
Police Officer 3,2421,2421,2411,2421,2421,2421,2421,2421,2421,0,2421,0,2421

** How many Job Titles were represented by only one person in 2013? (e.g. Job Titles with only one occurence in 2013?) **

In [64]:
SalariesFrame.loc[SalariesFrame['Year'] == 2013].groupby(by='EmployeeName')

,Id,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Status,count
EmployeeName,,,,,,,,,,,
A Bernard Fatooh,102844.0,23908.50,0.00,15.12,5455.62,23923.62,29379.24,2013.0,NaN,NaN,1.0
A. James Robertson Ii,103641.0,9827.56,0.00,12774.24,0.00,22601.80,22601.80,2013.0,NaN,NaN,1.0
A.K. Finizio,105021.0,13553.78,0.00,210.15,137.64,13763.93,13901.57,2013.0,NaN,NaN,1.0
Aaliyah V Hogue,100915.0,33271.68,0.00,0.00,17859.80,33271.68,51131.48,2013.0,NaN,NaN,1.0
Aaran Y Luo,87934.0,66724.34,14958.24,344.20,33122.86,82026.78,115149.64,2013.0,NaN,NaN,1.0
...,...,...,...,...,...,...,...,...,...,...,...
Zulaika W Mayfield,103657.0,13615.24,556.01,54.79,8242.09,14226.04,22468.13,2013.0,NaN,NaN,1.0
Zulema G Gutierrez,98364.0,50723.62,0.00,2922.12,22195.59,53645.74,75841.33,2013.0,NaN,NaN,1.0
Zun Jin Zhang He,96370.0,55026.00,997.68,3561.80,25239.95,59585.48,84825.43,2013.0,NaN,NaN,1.0
Zuna T Luu,97364.0,55026.00,0.00,1129.44,24776.86,56155.44,80932.30,2013.0,NaN,NaN,1.0
Zuri Jones,93464.0,71986.90,0.00,0.00,22727.21,71986.90,94714.11,2013.0,NaN,NaN,1.0

** How many people have the word Chief in their job title? (This is pretty tricky) **

In [71]:
SalariesFrame.loc[SalariesFrame['JobTitle'].str.contains('Chief')]['JobTitle'].count()

423

** Bonus: Is there a correlation between length of the Job Title string and Salary? **

In [76]:
SalariesFrame['title_len'] = SalariesFrame['JobTitle'].apply(lambda x: len(x))
SalariesFrame.head(5)

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status,count,title_len
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN,1,46
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN,1,31
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN,1,31
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN,1,36
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN,1,44

In [79]:
SalariesFrame['title_len'].corr(SalariesFrame['TotalPayBenefits'])

-0.03687844593260671

In [80]:
SalariesFrame['TotalPayBenefits'].corr(SalariesFrame['title_len'])

-0.03687844593260671

In [81]:
SalariesFrame['title_len'].corr(SalariesFrame['title_len'])

1.0

In [82]:
SalariesFrame['TotalPayBenefits'].corr(SalariesFrame['TotalPayBenefits'])

1.0

In [83]:
newCorreFrame = SalariesFrame[['TotalPayBenefits', 'title_len']]
newCorreFrame.corr()

                  TotalPayBenefits  title_len
TotalPayBenefits          1.000000  -0.036878
title_len                -0.036878   1.000000

In [16]:
newCorreFrame = SalariesFrame[['TotalPayBenefits', 'title_len']]
newCorreFrame.corr()

                  title_len  TotalPayBenefits
title_len          1.000000         -0.036878
TotalPayBenefits  -0.036878          1.000000

# Great Job!